<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"881029f9c4904a8ecda7492ea2b736dd798ab5eef02bb620fe1892a881703ed7","plan_job_ref":"Job Test plan target and replace #354 at https://github.com/dflook/terraform-github-actions/actions/runs/5662408215","plan_hash":"be30ed87862531bdfc85f1419774a5065066ca326131d87fe4eb47f0e75282eb","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "OyWNnNkNv3" -> (known after apply)
  ~ foreach = "9gQvddIJil" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #354](https://github.com/dflook/terraform-github-actions/actions/runs/5662408215)